Repository: Raphux/passhport
Catalog: docs/po/*/LC_MESSAGES/getting-started.po
Languages: fr

source: Getting started
fr: Premiers pas

source: So you now have a brand new installation of PaSSHport, but you don't know what to do next…
fr: Vous avez donc maintenant une toute nouvelle installation de PaSSHport, mais vous ne savez pas quoi faire ensuite…

source: Example prerequisites
fr: Exemple d'architecture

source: For this tutorial, we will use the following infos :
fr: Pour ce tutoriel, nous utiliserons les informations suivantes :

source: 1 PaSSHport node
fr: 1 serveur PaSSHport

source: We'll use a monolithic installation of PaSSHport : passhportd, passhport and passhport-admin are on the same host.
fr: Nous utiliserons une installation monolithique de PaSSHport : passhportd, passhport et passhport-admin sont sur la même machine.

source: **3 users**
fr: **3 utilisateurs**

source: John, a linux/unix administrator, who needs to access all linux/unix servers
fr: John, un administrateur linux/unix, qui doit accéder à l'ensemble des serveurs linux/unix

source: Vincent, a network administrator, who needs to access all network appliances
fr: Vincent, un administrateur réseau, qui a besoin d'accéder à tous les périphériques réseaux

source: Alice, a general appliance administrator who needs to access all tier appliances
fr: Alice, une administratrice généraliste, qui a besoin d'accéder à tous les périphériques tiers

source: Yann, a consultant who's here for a temporary mission about storage infrastructure, that need to access the NAS server and a the SAN bay
fr: Yann, un consultant qui est ici pour une mission temporaire sur l'infrastructure de stockage, qui a besoin d'accéder au server NAS et à la bas SAN

source: **1 PaSSHport admin**
fr: **1 administrateur PaSSHport**

source: Marc, the ISSM, who configures PaSSHport, to control all the access rights
fr: Marc, le RSSI, qui configure PaSSHport, et qui contrôle les droits d'accès

source: **3 types of targets**
fr: **3 type de targets (serveur cible)**

source: Linux/Unix servers :
fr: Serveurs Linux/Unix :

source: 1 web server, Linux, www-server / 10.0.1.24
fr: 1 serveur web, Linux, www-server / 10.0.1.24

source: 1 VPN server, OpenBSD, vpn-srv1 / 10.0.23.51
fr: 1 serveur VPN, OpenBSD, vpn-srv1 / 10.0.23.51

source: 1 NAS server, FreeBSD, nas-srv1 / 10.0.12.87
fr: 1 serveur NAS, FreeBSD, nas-srv1 / 10.0.12.87

source: Network appliances
fr: Périphérique réseau

source: 1 WiFi access points, net-AP9-23 / 172.22.9.23
fr: 1 point d'accès WiFi, net-AP9-23 / 172.22.9.23

source: 1 router, net-RO10-98 / 172.16.10.98
fr: 1 routeur, net-RO10-98 / 172.16.10.98

source: 1 network switch, net-SW22-57 / 172.20.22.57
fr: 1 commutateur réseau (switch), net-SW22-57 / 172.20.22.57

source: Other appliances
fr: Autre périphériques

source: 1 IPBX, ipbx1 / 10.192.98.76
fr: 1 IPBX (serveur voix sur IP), ipbx1 / 10.192.98.76

source: 1 Network printer, prntr44 / 192.168.254.44
fr: 1 imprimante réseau, prntr44 / 192.168.254.44

source: 1 SAN bay, san1 / 10.192.1.10
fr: 1 bay SAN, san1 / 10.192.1.10

source: Configure targets
fr: Configurer les targets

source: First of all, we'll include the targets into PaSSHport.
fr: Tout d'abord, nous allons enregistrer les targets dans PaSSHport

source: Let's connect to your PaSSHport node, and add the linux target. We can do this as passhport user :
fr: On se connecte au serveur PaSSHport, et on ajout le serveur linux. On peut le faire en tant qu'utilisateur passhport :

source: We can check that the target has been well recorded :
fr: On peut vérifier que la target a été correctement enregistrée :

source: Now let's add the other Linux/Unix server :
fr: Maintenant, ajoutons les autres serveurs Linux/Unix :

source: Do the same for the network appliances, and the remaining :
fr: On fait la même chose avec les périphériques réseaux, et les autres :

source: We now have all our targets configured into PaSSHport.
fr: Nous avons désormais l'ensemble de nos targets configurées dans PaSSHport.

source: Special target, with a specific login
fr: Target avec un login spécifique

source: We want to be able to connect to the SAN bay, as another user, because Yann should not have access to the SAN bay as the root user, but as "admin" user :
fr: Nous voulons être capable de nous connecter à la baie SAN, en tant un autre utilisateur que root, car Yann (le prestataire) ne doit accéder à cette baie en tant que root, mais en tant qu'utilisateur "admin" :

source: The SAN will now be accessible through two targets : "san1" and "admin@san1".
fr: La baie SAN sera désormais accessible à travers deux targets : "san1" et "admin@san1".

source: Configure target's groups
fr: Configuration des groupes de targets (targetgroup)

source: We'll group the targets we just created into three groups : unices, network and others.
fr: Nous groupons les targets que nous venons de créer dans trois groupes : unices, network, et autres.

source: We create the groups :
fr: Nous créons les groupes :

source: Now we put the targets into the corresponding target groups :
fr: Maintenant nous mettons les targets dans les groupes correspondant :

source: I'm a bit lazy, so I'll script the remainings :
fr: Je suis paresseux, je vais donc "scripter" un peu tout ça :

source: We'll create a last group, that will have all the targets in it (again, I'm gonna script this) :
fr: Nous créons un dernier groupe, qui contiendra l'ensemble des targets (je vais encore le scripter) :

source: We're now done with the targets/targetgroups, at least for the moment…
fr: On en a terminé avec les targets et les targetgroups (au moins pour le moment)…

source: Configure the users
fr: Configuration des utilisateurs

source: We take it for granted that our users have all created a ssh public key (rsa, dsa or ecdsa), and that they gave us the public part. We have all the following keys :
fr: Nous partons du préalable que nos utilisateurs on déjà crée leur clé publique SSH (rsa, dsa ou ecdsa), et qu'il nous on donné leur clé publique. Nous avons les clés suivantes :

source: Alice, a 2048 bits RSA key :
fr: Alice, une clé RSA de 2048 bits :

source: John, an 521 bits ECDSA key :
fr: John, une clé ECDSA de 521 bits :

source: Marc, a 4096 bits RSA key :
fr: Marc, une clé RSA de 4096 bits :

source: Vincent, a 521 bits ECDSA key :
fr: Vincent, une clé ECDSA de 521 bits :

source: And Yann, a 2048 bits RSA key :
fr: Et Yann, une clé RSA de 2048 bits :

source: With those keys, we can add the users as follow…
fr: Avec ces clés, nous pouvons ajouter les utilisateurs, des manières suivantes…

source: Interactively :
fr: De manière interactive :

source: On a single line, one shot :
fr: Sur une seule ligne, en un coup :

source: We add the others :
fr: Nous ajoutons les autres :

source: As you can see above, I forgot to put a comment on "marc@myfirm.com" account. Let's add one :
fr: Comme vous pouvez le voir ci-dessus, nous avons oublié de mettre un commentaire pour l'utilisateur "marc@myfirm.com". Ajoutons-en un :

source: Users are now created. Let's put them in usergroups…
fr: Les utilisateurs sont maintenant créer. Mettons les dans des groupes d'utilisateur (usergroup)…

source: Configure usergroups :
fr: Configuration des usergroups

source: Even if in this example we only have one user for each purpose of administration, it's generaly a good idea to add a group for one type skill.
fr: Même si dans ce tutoriel, nous n'avons qu'un utilisateur pour chaque type de machine à administrer, il est généralement conseillé de créer un groupe pour chaque type de compétence.

source: Let's add those groups :
fr: Ajoutons ces groupes :

source: We add the users to each corresponding groups :
fr: Nous ajoutons chaque utilisateur au groupe lui correspondant :

source: Connect usergroups and targetgroups :
fr: Mise en ralation des groupe

source: We now can connect each usergroups to targetgroups :
fr: Nous pouvons maintenant connecter chaque usergroup à son targetgroup :

source: Special configuration for Yann :
fr: Configuration spécifique pour le prestataire Yann :

source: Because Yann is only here for a short mission, and need to access to different targets, that won't be grouped into a targetgroup, so we connect him directly to the targets :
fr: Comme Yann n'est ici que pour une courte mission, et qu'il a besoin d'accéder à différentes targets qui n'ont pas vocations à être groupée au sein d'un targetgroup, nous connectons directement l'utilisateur à ses targets :

source: As you can see above, we did not give Yann access directly to san1 as root, but as admin user, through the admin@san1 target we created before.
fr: Comme vous pouvez le voir ci-dessus, nous n'avons pas donné à Yann l'accès a la baie SAN san1 en tant que root, mais en tant qu'utilisateur admin, grâce à la target admin@san1 précédemment configurée.

source: Check rights :
fr: Vérification des droits d'accès :

source: We can check what we configured with the "show" sub-command of passhport-admin :
fr: On peut vérifier ce que nous avons configuré avec la sous-commande "show" de passhport-admin :

source: As you can see, the "show" sub-command shows how the user has access to each target. We can see above that Marc has access to all the target we configured, because we placed him in the "super_admins" group.
fr: Comme on peut le voir, la sous commande "show" montre comment un utilisateur à accès à une target. Nous pouvons voir ci-dessus que Marc a accès à toutes targets configurées, parce que nous l'avons placé dans le usergroup "super_admins".

source: Here is the example for Yann :
fr: Voici l'exemple de Yann :

source: You can see above that Yann has a direct access to targets, not through usergroups, or targetgroups.
fr: On peut voir ci-dessus que Yann à un accès direct aux target, sans passer par des usergroup, ou des targetgroup.

source: Let's connect !
fr: Connectons-nous !

source: Let's say that I'm John, I connect to PaSSHport, using the id_rsa key that I sent to the PaSSHport admin :
fr: Mettons nous maintenant dans la peau de John : je me connect à PaSSHport, en utilisant la clé id_ecdsa que j'ai envoyé à l'administrateur de PaSSHport :

source: As John, I can see that I can access to 3 servers : www-server, vpn-srv1 and nas-srv1. I can now access to each server, using :
fr: En tant que John, je constate que je peux accéder à trois serveurs : www-server, vpn-srv1, et nas-srv1. Je peux maintenant accéder à chacun de ces serveurs, selon les méthodes suivantes :

source: the number in the first column;
fr: Le numéro situé dans la première colonne;

source: the name of the server (www-serve…);
fr: le nom du serveur (www-server…);

source: the IP address.
fr: l'adresse IP.

source: John is now on the www-server.
fr: John est maintenant sur le serveur www-server.

source: Let's say that I'm now Alice, a Windows user. I'm going to use putty to connect to PaSSHport. Let's configure putty…
fr: Je suis maintenant dans la peau d'Alice, dont le poste de travail est sous Windows. Je vais utiliser l'outil Putty pour me connecter à PaSSHport. Voilà comment le configurer :

source: We launch Putty (you can download it from `here <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`__), and on the left configuration tree, goes to `Connection -> SSH -> Auth` , then select the ppk key Alice generated (with puttygen for exemple) :
fr: On lance Putty (téléchargable `ici <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`__), et sur la partie gauche, on clique sur `Connection -> SSH -> Auth`, pour selectionner la clé PPK qu'Alice a créé (avec l'outil puttygen par exemple) :

source: Then we go to `Connection -> SSH -> Data` , and set the login name as passhport :
fr: Ensuite nous allons dans `Connection -> SSH -> Data` , et mettons le username à `passhport` :

source: Finally, we go to the root of the configuration tree `Session` :
fr: Pour finir, on retourne à la racine de l'arbre de configuration, dans la section `Session` :

source: enter the hostname or IP of your PaSSHport server
fr: on entre le nom d'hôte ou l'IP du serveur PaSSHport

source: enter its SSH port (usually 22)
fr: on entre le port du serveur SSH (généralement 22)

source: select `SSH` as connection type
fr: on sélectionne `SSH` comme type de connexion

source: enter a name for this connection configuration
fr: on entre le nom sous lequel sauver la configuration que nous venons de mettre en place

source: For debugging purpose, it may be useful to `Never` close window on exit (so you can see the error message).
fr: Pour débugger une connexion défaillante, il est souvent utile de sélectionner l'option `Never` dans la section `Close window on exit`, et ce, afin de voir la raison de déconnexion.

source: Save, and click Open !
fr: On sauve, et on clique le bouton `Open`, pour lancer la connexion !

source: If it's the first time we connect to the PaSSHport server, we'll have a window that says the fingerprint is new, and ask us if we want to accept it… Just accept it :
fr: Si c'est la première fois qu'on se connecte sur le serveur PaSSHport, une fenêtre indiquant qu'il faut vérifier l'empreinte du serveur, et si on doit l'accepter… On l'accepte en cliquant le bouton `Oui` :

source: Then we'll have the PaSSHport prompt, and as we want to connect to IPBX, we select `1` :
fr: Nous avons ensuite le prompt de PaSSHport, et comme nous voulons nous connecter à l'IPBX, on sélection l'entrée `1` :

source: We are now landed on our target.
fr: On est désormais sur notre serveur cible.

source: Last relevant example, Yann, who access nas-srv1 and san1. He uses a linux laptop :
fr: Dernier exemple intéressant, Yann, qui accède au serveur nas-srv1 et san1. Il utilise un ordinateur portable sous linux :

source: He can now connect to any of those two servers.
fr: Il peut désormais accéder au deux serveurs relatifs à sa mission.

source: Delete a user
fr: Suppression d'un utilisateur

source: Yann has finished his mission, and left the compagny. There is two way to revoke his access :
fr: Yann a désormais fini sa mission, et a quitté la société. On peut révoquer ses droits de deux manières :

source: remove all his target ;
fr: en enlevant les liaisons de son compte (que ce soit une target, un targetgroup, ou un usergroup) ;

source: delete the user.
fr: en supprimant l'utilisateur.

source: You may prefer the first way if you know that Yann will may come back later to do another mission, so you won't have to recreate the user (get his ssh key, etc…). Here is how you can delete his access…
fr: Il parfois plus judicieux d'utiliser la première méthode, quand on sait par exemple que l'utilisateur est susceptible de revenir plus tard, et ne pas avoir à le recréer (et devoir récupérer sa clef, et ses informations…). Voici comment procéder :

source: First, list his rights :
fr: Premièrement, on liste ses droits :

source: You can see that he has access to nas-srv1 and admin@san1, directly. Let's revoke those access :
fr: On peut voir qu'il a accès aux targets nas-srv1 et admin@san1, directement. Révoquons ces droits :

source: Yann won't have access to any target anymore :
fr: Yann n'aura désormais plus accès à ces targets :

source: The second option, is to delete the user :
fr: La seconde option est de supprimer cet utilisateur :

source: You should now be able to use the basic functions of PaSSHport.
fr: Vous devriez être désormais capable d'utiliser les fonctions basiques de PaSSHport.
